# ws2DelMenu

## Description
Workspace advanced APIs. Delete the menu at the specified menu path. See 'ws2GetMenusCnt'.

```pascal
FUNCTION ws2DelMenu(menuPath : DYNARRAY[] of CHAR) : BOOLEAN;
```

```python

def vs.ws2DelMenu(menuPath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|menuPath|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2021
## Category
* Workspaces